app/views/seller_profiles/show.html.erb

SELECT  "seller_profiles".* FROM "seller_profiles" WHERE "seller_profiles"."seller_id" = ? ORDER BY "seller_profiles"."id" ASC LIMIT ?  [["seller_id", 3], ["LIMIT", 1]]
---
  <nav>
    <%if SellerProfile.where(seller_id: current_seller.id).first %>