app/views/home/cart.html.erb

	<div class="cart_list">
  <%=Book.where(id: p.books_id).first.name%>
	<%=Book.where(id: p.books_id).first.user_price.to_i%>
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? ORDER BY "books"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]