app/views/home/index.html.erb

					<div class="col-md-9 news-in">
						<h5><%=link_to Course.where(status: 1).order(created_at: :desc).first.name, url_for(controller: :home, action: :showCourse, id: Course.where(status: 1).order(created_at: :desc).first.id), method: :get %></h5>
---
SELECT  "courses".* FROM "courses" WHERE "courses"."status" = ? ORDER BY "courses"."created_at" DESC LIMIT ? OFFSET ?  [["status", 1], ["LIMIT", 1], ["OFFSET", 1]]