app/views/home/showCourse.html.erb

<ul>
  <%@course.course_makers.order(pg_no: :asc).each do |course_maker|%>
---
SELECT "course_makers".* FROM "course_makers" WHERE "course_makers"."course_id" = ? ORDER BY "course_makers"."pg_no" ASC  [["course_id", 1]]