app/views/quoras/_section.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
			<% else %>
			By: <%=User.where(id: quora.user_id).first.email %>

SELECT  "quoras".* FROM "quoras" WHERE "quoras"."question_id" = ? ORDER BY "quoras"."id" ASC LIMIT ?  [["question_id", 20], ["LIMIT", 1]]
---
		<br><br>
		<%ans=Quora.where(question_id: quora.id).first%>