app/views/course_makers/_content.html.erb

SELECT  "course_makers".* FROM "course_makers" WHERE "course_makers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<div class="section">
  <%=raw (CourseMaker.find(course_maker_id).section1)%>