app/views/course_makers/index.html.erb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%else%>
<%= link_to "preview course", course_path(@course_makers.first.course)%>