app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."seller_id" = ?  [["seller_id", 2]]
---
  def index
    @books = Book.where(seller_id: current_seller.id);

INSERT INTO "books" ("seller_id", "name", "seller_price", "user_price", "qunatity_in_stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    @book.user_price=(@book.seller_price.to_f)*1.1
    @book.seller_id = current_seller.id
    respond_to do |format|
      if @book.save

UPDATE "books" SET "qunatity_in_stock" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["qunatity_in_stock", 5], ["updated_at", "2017-07-16 06:03:34.567891"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)