app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 10]]
---
  def destroy
    @cart.destroy_all

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."status" = ?  [["user_id", 1], ["status", 0]]
---
    def set_cart
      @cart = Cart.where(user_id: params[:id].to_i,status: 0)