app/controllers/courses_controller.rb

  def index
    @teacher=current_teacher
    @courses = Course.where(teacher_id: @teacher.id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = 1 AND "courses"."teacher_id" = ? ORDER BY "courses"."id" ASC LIMIT ?  [["teacher_id", 1], ["LIMIT", 1]]

  def statusChange
    @course =Course.find(params[:course_id])
    @course.toggleStatus
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "courses" SET "status" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["status", 1], ["updated_at", "2017-07-29 11:44:56.778193"], ["id", 1]]

  def create
    @teacher=current_teacher
    @course = Course.new(course_params)
    @course.teacher=@teacher

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "first course"], ["teacher_id", 1], ["created_at", "2017-07-29 11:37:37.269577"], ["updated_at", "2017-07-29 11:37:37.269577"]]