app/controllers/course_makers_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "course_makers".* FROM "course_makers" WHERE "course_makers"."course_id" = 1 ORDER BY "course_makers"."pg_no" ASC
---
  def index
    @teacher =current_teacher
    puts @teacher.email
    @course=Course.find(params[:course_id])

      puts @course.name
      @course_makers = CourseMaker.where(course: @course).order(pg_no: :asc)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @course=Course.find(params[:course_id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "course_makers" ("course_id", "pg_no", "pg_name", "section1", "section2", "section3", "section4", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course=Course.find(params[:course_id])
    puts @course.id
    @course_maker = CourseMaker.new(course_maker_params)
    @course_maker.course=@course

    respond_to do |format|
      if @course_maker.save

SELECT  "course_makers".* FROM "course_makers" WHERE "course_makers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course_maker
      @course_maker = CourseMaker.find(params[:id])