app/controllers/home_controller.rb

	def courses
		puts params
		puts "here"
		@courses=Course.where(status: 1)
---
SELECT "courses".* FROM "courses" WHERE "courses"."status" = ?  [["status", 1]]

	def showCourse
		@course=Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def shop
    @books= Book.all
---
SELECT  "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]

  def cart
    @products = Cart.where(user_id: current_user.id,status: 0)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? ORDER BY "carts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def create
    cart=Cart.where(books_id: params["books"].to_i,status: 0)
    if cart.length==0
    @cart = Cart.new
    @cart.user_id=current_user.id
    @cart.seller_id= Book.where(id: params["books"].to_i).first.seller_id
    @cart.books_id=params["books"].to_i
    respond_to do |format|
      if @cart.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? ORDER BY "books"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."books_id" = ? AND "carts"."status" = ?  [["books_id", 1], ["status", 0]]
SELECT "carts".* FROM "carts" WHERE "carts"."book_id" = ? AND "carts"."status" = ?  [["book_id", 1], ["status", 1]]
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? ORDER BY "sellers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "books_id", "created_at", "updated_at", "seller_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["books_id", 1], ["created_at", "2017-07-26 05:39:48.612749"], ["updated_at", "2017-07-26 05:39:48.612749"], ["seller_id", 1]]

  def all
    @books = Book.all
---
SELECT "books".* FROM "books"

  def confirm
    if Cart.where(user_id: current_user.id,status: 0).update(status: 1)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."status" = ?  [["user_id", 1], ["status", 0]]
UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["status", 1], ["updated_at", "2017-07-28 04:58:45.072569"], ["id", 30]]