app/controllers/quoras_controller.rb

  def index

    @quoras = Quora.where(question_id: nil)
---
SELECT  "quoras".* FROM "quoras" WHERE "quoras"."question_id" = ? ORDER BY "quoras"."id" ASC LIMIT ?  [["question_id", 20], ["LIMIT", 1]]

  def show
    @answers = Quora.where(question_id: @quora.id)
---
SELECT "quoras".* FROM "quoras" WHERE "quoras"."question_id" = ?  [["question_id", 14]]

  def create
    @quora = Quora.new(quora_params)
    @quora.user_id = current_user.id
    respond_to do |format|
      if @quora.save
        if @quora.question_id.nil?
          format.html { redirect_to '/quoras', notice: 'Question was successfully created.' }
        format.json { render :show, status: :created, location: @quora }
        else
          AnswerMailer.answer_mailer(User.where(id: @quora.user_id).first.email)
---
INSERT INTO "quoras" ("content", "question_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "done"], ["question_id", 20], ["created_at", "2017-07-24 04:50:13.894214"], ["updated_at", "2017-07-24 04:50:13.894214"], ["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
      if @quora.user_id==current_user.id
        respond_to do |format|
          if @quora.update(quora_params)
---
UPDATE "quoras" SET "content" = ?, "updated_at" = ? WHERE "quoras"."id" = ?  [["content", "done2"], ["updated_at", "2017-07-25 03:59:00.792803"], ["id", 27]]

  def destroy

    quoraa=Quora.where(question_id: @quora.id)
    quoraa.destroy_all
---
SELECT "quoras".* FROM "quoras" WHERE "quoras"."question_id" = ?  [["question_id", 12]]
DELETE FROM "quoras" WHERE "quoras"."id" = ?  [["id", 1]]

    def set_quora
      @quora = Quora.find(params[:id])
---
SELECT  "quoras".* FROM "quoras" WHERE "quoras"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]