app/controllers/seller_profiles_controller.rb

  def index
    @seller_profiles = SellerProfile.all
---
SELECT "seller_profiles".* FROM "seller_profiles"

  def create
    @seller_profile = SellerProfile.new(seller_profile_params)
    @seller_profile.seller_id=current_seller.id

    respond_to do |format|
      if @seller_profile.save
---
INSERT INTO "seller_profiles" ("seller_id", "name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["seller_id", 3], ["name", "asldkfji"], ["address", "saldkfj sadlfkji"], ["created_at", "2017-07-29 12:35:01.609490"], ["updated_at", "2017-07-29 12:35:01.609490"]]

  def update
    respond_to do |format|
      if @seller_profile.update(seller_profile_params)
---
UPDATE "seller_profiles" SET "address" = ?, "updated_at" = ? WHERE "seller_profiles"."id" = ?  [["address", "sth again"], ["updated_at", "2017-08-04 02:46:13.245644"], ["id", 5]]

    def set_seller_profile
      @seller_profile = SellerProfile.find(params[:id])
---
SELECT  "seller_profiles".* FROM "seller_profiles" WHERE "seller_profiles"."seller_id" = ? ORDER BY "seller_profiles"."id" ASC LIMIT ?  [["seller_id", 3], ["LIMIT", 1]]