app/controllers/user_profiles_controller.rb

  def index
    @user_profiles = UserProfile.all
---
SELECT "user_profiles".* FROM "user_profiles"

  def create
    @user_profile = UserProfile.new(user_profile_params)
    @user_profile.user_id=current_user.id
    @user_profile.credit = 0
    @user_profile.debit = 0
    respond_to do |format|
      if @user_profile.save
---
INSERT INTO "user_profiles" ("user_id", "name", "address", "credit", "debit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Harsh Goyal"], ["address", "abc"], ["credit", 0.0], ["debit", 0.0], ["created_at", "2017-07-16 10:45:56.629771"], ["updated_at", "2017-07-16 10:45:56.629771"]]

  def update
    respond_to do |format|
      if @user_profile.update(user_profile_params)
---
UPDATE "user_profiles" SET "address" = ?, "updated_at" = ? WHERE "user_profiles"."id" = ?  [["address", "new delhi"], ["updated_at", "2017-07-27 04:06:00.720717"], ["id", 1]]

    def set_user_profile
      @user_profile = UserProfile.where(user_id: params[:id]).first
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? ORDER BY "user_profiles"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]